---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
FabricSheet..::..GetWireCenterlines Method
FabricSheet Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | GetWireCenterlines()()()() | Gets a list of curves representing the wires centerlines of the Fabric Sheet in the both distribution directions. |
|  | GetWireCenterlines(WireDistributionDirection) | Gets a list of curves representing the wires centerlines of the Fabric Sheet. |

# See Also

FabricSheet Class

FabricSheet Members

Autodesk.Revit.DB.Structure Namespace